In [3]:
import pandas as pd

df = pd.DataFrame({
    'nome' : ['ana','Bruno','carlos','Daniela'],
    'idade': [23,30,19,25],
    'cidade':['SP','rj','Sp','bh'],
    'salario':[3000,4500,2000,3800]
})

In [4]:
df['idade_ano_que_vem'] = df['idade'] + 1

In [5]:
df

      nome  idade cidade  salario  idade_ano_que_vem
0      ana     23     SP     3000                 24
1    Bruno     30     rj     4500                 31
2   carlos     19     Sp     2000                 20
3  Daniela     25     bh     3800                 26

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 5 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   nome               4 non-null      object
 1   idade              4 non-null      int64
 2   cidade             4 non-null      object
 3   salario            4 non-null      int64
 4   idade_ano_que_vem  4 non-null      int64
dtypes: int64(3), object(2)
memory usage: 292.0+ bytes

# realocar coluna

In [7]:
colunas = list(df.columns)
print(colunas)

['nome', 'idade', 'cidade', 'salario', 'idade_ano_que_vem']

In [8]:
colunas.remove("idade_ano_que_vem")
colunas.insert(2,'idade_ano_que_vem')
df = df[colunas]
df

      nome  idade  idade_ano_que_vem cidade  salario
0      ana     23                 24     SP     3000
1    Bruno     30                 31     rj     4500
2   carlos     19                 20     Sp     2000
3  Daniela     25                 26     bh     3800

In [9]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 5 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   nome               4 non-null      object
 1   idade              4 non-null      int64
 2   idade_ano_que_vem  4 non-null      int64
 3   cidade             4 non-null      object
 4   salario            4 non-null      int64
dtypes: int64(3), object(2)
memory usage: 292.0+ bytes

In [10]:
df

      nome  idade  idade_ano_que_vem cidade  salario
0      ana     23                 24     SP     3000
1    Bruno     30                 31     rj     4500
2   carlos     19                 20     Sp     2000
3  Daniela     25                 26     bh     3800